ETL/Documents/ПлановыеДанныеОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПлановыеДанныеОтчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеДанныеОтчетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПлановыеОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПлановыхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтрокиПлановыхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаСтрокиОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиСтрокПлановыхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ETL/Catalogs/ПлановыеОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ПлановыеОрганизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Documents/ПлановыеДанныеОтчетов/Forms/ФормаВыбораОрганизации/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьБазу(База)
	
	Результат = Новый Структура;
	Результат.Вставить("База", Справочники.Базы.ПустаяСсылка());
	Результат.Вставить("ДатаПоследнегоПринятогоСообщения", Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Базы.Ссылка КАК База,
	               |	Базы.ДатаПринятияСообщения КАК ДатаПоследнегоПринятогоСообщения
	               |ИЗ
	               |	Справочник.Базы КАК Базы
	               |ГДЕ
	               |	Базы.Наименование = &База";
	Запрос.УстановитьПараметр("База", База);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("База", Выборка.База);
		Результат.Вставить("ДатаПоследнегоПринятогоСообщения", Выборка.ДатаПоследнегоПринятогоСообщения);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокОрганизаций()
	
	Список.Очистить();
	
	ОбменSQL = Обработки.ОбменSQL.Создать();
	Команда = ОбменSQL.Соединение();
	Команда.CommandType = 1;
	Команда.CommandTimeout = 360;	
	Команда.CommandText = 	"SELECT [GUID]
							|      ,[Base]
							|      ,[Name]
							|      ,[IIN]
							|	FROM [BW].[dbo].[Organizations]
							|	WHERE [GUID] LIKE '____________________________________'
							|	AND Base Is Not Null";
	
	Выборка = Команда.Execute();
	
	СоответствиеБаз = Новый Соответствие;
	Пока НЕ Выборка.EOF Цикл
		НовСтрока = Список.Добавить();
		НовСтрока.GUID = Выборка.Fields("GUID").Value; 
		НовСтрока.Наименование = Выборка.Fields("Name").Value;
		НовСтрока.ИНН = Выборка.Fields("IIN").Value;
		
		СтруктураБазы = СоответствиеБаз.Получить(Выборка.Fields("Base").Value);
		Если СтруктураБазы = Неопределено Тогда
			СтруктураБазы = ПолучитьБазу(Выборка.Fields("Base").Value);
			СоответствиеБаз.Вставить(Выборка.Fields("Base").Value, СтруктураБазы);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НовСтрока, СтруктураБазы); 

		Выборка.MoveNext();
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуОрганизации(Структура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПлановыеОрганизации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПлановыеОрганизации КАК ПлановыеОрганизации
	               |ГДЕ
	               |	ПлановыеОрганизации.GUID = &GUID";
	Запрос.УстановитьПараметр("GUID", Структура.GUID);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		ОрганизацияОбъект = Справочники.ПлановыеОрганизации.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(ОрганизацияОбъект, Структура);
		ОрганизацияОбъект.УстановитьНовыйКод();
		ОрганизацияОбъект.Записать();
		Результат = ОрганизацияОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокОрганизаций();
	ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСписокОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;	
	
	Структура = Новый Структура;
	Структура.Вставить("GUID", Элементы.Список.ТекущиеДанные.GUID); 
	Структура.Вставить("База", Элементы.Список.ТекущиеДанные.База);
	Структура.Вставить("Наименование", Элементы.Список.ТекущиеДанные.Наименование);
	Структура.Вставить("ИНН", Элементы.Список.ТекущиеДанные.ИНН);

	ОповеститьОВыборе(ПолучитьСсылкуОрганизации(Структура));
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ОповеститьОВыборе(ПредопределенноеЗначение("Справочник.ПлановыеОрганизации.ПустаяСсылка"));
	Иначе
		Структура = Новый Структура;
		Структура.Вставить("GUID", Элементы.Список.ТекущиеДанные.GUID); 
		Структура.Вставить("База", Элементы.Список.ТекущиеДанные.База);
		Структура.Вставить("Наименование", Элементы.Список.ТекущиеДанные.Наименование);
		Структура.Вставить("ИНН", Элементы.Список.ТекущиеДанные.ИНН);

		ОповеститьОВыборе(ПолучитьСсылкуОрганизации(Структура));	
	КонецЕсли;
		
КонецПроцедуры
